# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Nelson\Desktop\121 labs\CMPE121 Lab Project\Oscilloscope\PSOC\Oscilliscope.cydsn\Oscilliscope.cyprj
# Date: Mon, 26 Nov 2018 22:27:56 GMT
#set_units -time ns
create_clock -name {ADC_DelSig_Ext_CP_Clk(routed)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {ADC_SAR_1_theACLK(routed)} -period 708.33333333333326 -waveform {0 354.166666666667} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {ADC_SAR_2_theACLK(routed)} -period 708.33333333333326 -waveform {0 354.166666666667} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {Clock_1(routed)} -period 16666.666666666664 -waveform {0 8333.33333333333} [list [get_pins {ClockBlock/dclk_3}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {ADC_DelSig_Ext_CP_Clk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {ADC_SAR_1_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 17 35} -nominal_period 708.33333333333326 [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {ADC_SAR_2_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 17 35} -nominal_period 708.33333333333326 [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {ADC_DelSig_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 151 301} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {ADC_DelSig_theACLK(fixed-function)} -period 6250 -waveform {0 3125} [get_pins {ClockBlock/aclk_glb_ff_0}]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 401 799} -nominal_period 16666.666666666664 [list [get_pins {ClockBlock/dclk_glb_3}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Nelson\Desktop\121 labs\CMPE121 Lab Project\Oscilloscope\PSOC\Oscilliscope.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Nelson\Desktop\121 labs\CMPE121 Lab Project\Oscilloscope\PSOC\Oscilliscope.cydsn\Oscilliscope.cyprj
# Date: Mon, 26 Nov 2018 22:27:52 GMT
